/**
 * Created by yjy on 16/8/24.
 */
export default class cityCode {
    static CityZoneCode = {
        "China": {
            "Province": [{
                id: '110000',
                name: '北京市',
                City: [{
                    id: '010',
                    name: '北京市市辖区',
                    Area: [{id: '110101', name: '东城区'}, {id: '110102', name: '西城区'}, {id: '110105', name: '朝阳区'}, {
                        id: '110106',
                        name: '丰台区'
                    }, {id: '110107', name: '石景山区'}, {id: '110108', name: '海淀区'}, {id: '110109', name: '门头沟区'}, {
                        id: '110111',
                        name: '房山区'
                    }, {id: '110112', name: '通州区'}, {id: '110113', name: '顺义区'}, {id: '110114', name: '昌平区'}, {
                        id: '110115',
                        name: '大兴区'
                    }, {id: '110116', name: '怀柔区'}, {id: '110117', name: '平谷区'}, {id: '110228', name: '密云县'}, {
                        id: '110229',
                        name: '延庆县'
                    }]
                }]
            }, {
                id: '120000',
                name: '天津市',
                City: [{
                    id: '022',
                    name: '天津市市辖区',
                    Area: [{id: '120101', name: '和平区'}, {id: '120102', name: '河东区'}, {id: '120103', name: '河西区'}, {
                        id: '120104',
                        name: '南开区'
                    }, {id: '120105', name: '河北区'}, {id: '120106', name: '红桥区'}, {id: '120110', name: '东丽区'}, {
                        id: '120111',
                        name: '西青区'
                    }, {id: '120112', name: '津南区'}, {id: '120113', name: '北辰区'}, {id: '120114', name: '武清区'}, {
                        id: '120115',
                        name: '宝坻区'
                    }, {id: '120116', name: '滨海新区'}, {id: '120221', name: '宁河县'}, {id: '120223', name: '静海县'}, {
                        id: '120225',
                        name: '蓟县'
                    }]
                }]
            }, {
                id: '130000',
                name: '河北省',
                City: [{
                    id: '0310',
                    name: '邯郸市',
                    Area: [{id: '130402', name: '邯山区'}, {id: '130403', name: '丛台区'}, {id: '130404', name: '复兴区'}, {
                        id: '130406',
                        name: '峰峰矿区'
                    }, {id: '130421', name: '邯郸县'}, {id: '130423', name: '临漳县'}, {id: '130424', name: '成安县'}, {
                        id: '130425',
                        name: '大名县'
                    }, {id: '130426', name: '涉县'}, {id: '130427', name: '磁县'}, {id: '130428', name: '肥乡县'}, {
                        id: '130429',
                        name: '永年县'
                    }, {id: '130430', name: '邱县'}, {id: '130431', name: '鸡泽县'}, {id: '130432', name: '广平县'}, {
                        id: '130433',
                        name: '馆陶县'
                    }, {id: '130434', name: '魏县'}, {id: '130435', name: '曲周县'}, {id: '130481', name: '武安市'}]
                }, {
                    id: '0311',
                    name: '石家庄市',
                    Area: [{id: '130102', name: '长安区'}, {id: '130104', name: '桥西区'}, {id: '130105', name: '新华区'}, {
                        id: '130107',
                        name: '井陉矿区'
                    }, {id: '130108', name: '裕华区'}, {id: '130121', name: '井陉县'}, {id: '130123', name: '正定县'}, {
                        id: '130124',
                        name: '栾城区'
                    }, {id: '130125', name: '行唐县'}, {id: '130126', name: '灵寿县'}, {id: '130127', name: '高邑县'}, {
                        id: '130128',
                        name: '深泽县'
                    }, {id: '130129', name: '赞皇县'}, {id: '130130', name: '无极县'}, {id: '130131', name: '平山县'}, {
                        id: '130132',
                        name: '元氏县'
                    }, {id: '130133', name: '赵县'}, {id: '130181', name: '辛集市'}, {id: '130182', name: '藁城区'}, {
                        id: '130183',
                        name: '晋州市'
                    }, {id: '130184', name: '新乐市'}, {id: '130185', name: '鹿泉区'}]
                }, {
                    id: '0312',
                    name: '保定市',
                    Area: [{id: '130602', name: '新市区'}, {id: '130603', name: '北市区'}, {id: '130604', name: '南市区'}, {
                        id: '130621',
                        name: '满城县'
                    }, {id: '130622', name: '清苑县'}, {id: '130623', name: '涞水县'}, {id: '130624', name: '阜平县'}, {
                        id: '130625',
                        name: '徐水县'
                    }, {id: '130626', name: '定兴县'}, {id: '130627', name: '唐县'}, {id: '130628', name: '高阳县'}, {
                        id: '130629',
                        name: '容城县'
                    }, {id: '130630', name: '涞源县'}, {id: '130631', name: '望都县'}, {id: '130632', name: '安新县'}, {
                        id: '130633',
                        name: '易县'
                    }, {id: '130634', name: '曲阳县'}, {id: '130635', name: '蠡县'}, {id: '130636', name: '顺平县'}, {
                        id: '130637',
                        name: '博野县'
                    }, {id: '130638', name: '雄县'}, {id: '130681', name: '涿州市'}, {id: '130682', name: '定州市'}, {
                        id: '130683',
                        name: '安国市'
                    }, {id: '130684', name: '高碑店市'}]
                }, {
                    id: '0313',
                    name: '张家口市',
                    Area: [{id: '130702', name: '桥东区'}, {id: '130703', name: '桥西区'}, {id: '130705', name: '宣化区'}, {
                        id: '130706',
                        name: '下花园区'
                    }, {id: '130721', name: '宣化县'}, {id: '130722', name: '张北县'}, {id: '130723', name: '康保县'}, {
                        id: '130724',
                        name: '沽源县'
                    }, {id: '130725', name: '尚义县'}, {id: '130726', name: '蔚县'}, {id: '130727', name: '阳原县'}, {
                        id: '130728',
                        name: '怀安县'
                    }, {id: '130729', name: '万全县'}, {id: '130730', name: '怀来县'}, {id: '130731', name: '涿鹿县'}, {
                        id: '130732',
                        name: '赤城县'
                    }, {id: '130733', name: '崇礼县'}]
                }, {
                    id: '0314',
                    name: '承德市',
                    Area: [{id: '130802', name: '双桥区'}, {id: '130803', name: '双滦区'}, {
                        id: '130804',
                        name: '鹰手营子矿区'
                    }, {id: '130821', name: '承德县'}, {id: '130822', name: '兴隆县'}, {id: '130823', name: '平泉县'}, {
                        id: '130824',
                        name: '滦平县'
                    }, {id: '130825', name: '隆化县'}, {id: '130826', name: '丰宁满族自治县'}, {id: '130827', name: '宽城满族自治县'}, {
                        id: '130828',
                        name: '围场满族蒙古族自治县'
                    }]
                }, {
                    id: '0315',
                    name: '唐山市',
                    Area: [{id: '130202', name: '路南区'}, {id: '130203', name: '路北区'}, {id: '130204', name: '古冶区'}, {
                        id: '130205',
                        name: '开平区'
                    }, {id: '130207', name: '丰南区'}, {id: '130208', name: '丰润区'}, {id: '130209', name: '曹妃甸区'}, {
                        id: '130223',
                        name: '滦县'
                    }, {id: '130224', name: '滦南县'}, {id: '130225', name: '乐亭县'}, {id: '130227', name: '迁西县'}, {
                        id: '130229',
                        name: '玉田县'
                    }, {id: '130281', name: '遵化市'}, {id: '130283', name: '迁安市'}]
                }, {
                    id: '0316',
                    name: '廊坊市',
                    Area: [{id: '131002', name: '安次区'}, {id: '131003', name: '广阳区'}, {id: '131022', name: '固安县'}, {
                        id: '131023',
                        name: '永清县'
                    }, {id: '131024', name: '香河县'}, {id: '131025', name: '大城县'}, {id: '131026', name: '文安县'}, {
                        id: '131028',
                        name: '大厂回族自治县'
                    }, {id: '131081', name: '霸州市'}, {id: '131082', name: '三河市'}]
                }, {
                    id: '0317',
                    name: '沧州市',
                    Area: [{id: '130902', name: '新华区'}, {id: '130903', name: '运河区'}, {id: '130921', name: '沧县'}, {
                        id: '130922',
                        name: '青县'
                    }, {id: '130923', name: '东光县'}, {id: '130924', name: '海兴县'}, {id: '130925', name: '盐山县'}, {
                        id: '130926',
                        name: '肃宁县'
                    }, {id: '130927', name: '南皮县'}, {id: '130928', name: '吴桥县'}, {id: '130929', name: '献县'}, {
                        id: '130930',
                        name: '孟村回族自治县'
                    }, {id: '130981', name: '泊头市'}, {id: '130982', name: '任丘市'}, {id: '130983', name: '黄骅市'}, {
                        id: '130984',
                        name: '河间市'
                    }]
                }, {
                    id: '0318',
                    name: '衡水市',
                    Area: [{id: '131102', name: '桃城区'}, {id: '131121', name: '枣强县'}, {id: '131122', name: '武邑县'}, {
                        id: '131123',
                        name: '武强县'
                    }, {id: '131124', name: '饶阳县'}, {id: '131125', name: '安平县'}, {id: '131126', name: '故城县'}, {
                        id: '131127',
                        name: '景县'
                    }, {id: '131128', name: '阜城县'}, {id: '131181', name: '冀州市'}, {id: '131182', name: '深州市'}]
                }, {
                    id: '0319',
                    name: '邢台市',
                    Area: [{id: '130502', name: '桥东区'}, {id: '130503', name: '桥西区'}, {id: '130521', name: '邢台县'}, {
                        id: '130522',
                        name: '临城县'
                    }, {id: '130523', name: '内丘县'}, {id: '130524', name: '柏乡县'}, {id: '130525', name: '隆尧县'}, {
                        id: '130526',
                        name: '任县'
                    }, {id: '130527', name: '南和县'}, {id: '130528', name: '宁晋县'}, {id: '130529', name: '巨鹿县'}, {
                        id: '130530',
                        name: '新河县'
                    }, {id: '130531', name: '广宗县'}, {id: '130532', name: '平乡县'}, {id: '130533', name: '威县'}, {
                        id: '130534',
                        name: '清河县'
                    }, {id: '130535', name: '临西县'}, {id: '130581', name: '南宫市'}, {id: '130582', name: '沙河市'}]
                }, {
                    id: '0335',
                    name: '秦皇岛市',
                    Area: [{id: '130302', name: '海港区'}, {id: '130303', name: '山海关区'}, {id: '130304', name: '北戴河区'}, {
                        id: '130321',
                        name: '青龙满族自治县'
                    }, {id: '130322', name: '昌黎县'}, {id: '130323', name: '抚宁县'}, {id: '130324', name: '卢龙县'}]
                }]
            }, {
                id: '140000',
                name: '山西省',
                City: [{
                    id: '0349',
                    name: '朔州市',
                    Area: [{id: '140602', name: '朔城区'}, {id: '140603', name: '平鲁区'}, {id: '140621', name: '山阴县'}, {
                        id: '140622',
                        name: '应县'
                    }, {id: '140623', name: '右玉县'}, {id: '140624', name: '怀仁县'}]
                }, {
                    id: '0350',
                    name: '忻州市',
                    Area: [{id: '140902', name: '忻府区'}, {id: '140921', name: '定襄县'}, {id: '140922', name: '五台县'}, {
                        id: '140923',
                        name: '代县'
                    }, {id: '140924', name: '繁峙县'}, {id: '140925', name: '宁武县'}, {id: '140926', name: '静乐县'}, {
                        id: '140927',
                        name: '神池县'
                    }, {id: '140928', name: '五寨县'}, {id: '140929', name: '岢岚县'}, {id: '140930', name: '河曲县'}, {
                        id: '140931',
                        name: '保德县'
                    }, {id: '140932', name: '偏关县'}, {id: '140981', name: '原平市'}]
                }, {
                    id: '0351',
                    name: '太原市',
                    Area: [{id: '140105', name: '小店区'}, {id: '140106', name: '迎泽区'}, {id: '140107', name: '杏花岭区'}, {
                        id: '140108',
                        name: '尖草坪区'
                    }, {id: '140109', name: '万柏林区'}, {id: '140110', name: '晋源区'}, {id: '140121', name: '清徐县'}, {
                        id: '140122',
                        name: '阳曲县'
                    }, {id: '140123', name: '娄烦县'}, {id: '140181', name: '古交市'}]
                }, {
                    id: '0352',
                    name: '大同市',
                    Area: [{id: '140202', name: '城区'}, {id: '140203', name: '矿区'}, {id: '140211', name: '南郊区'}, {
                        id: '140212',
                        name: '新荣区'
                    }, {id: '140221', name: '阳高县'}, {id: '140222', name: '天镇县'}, {id: '140223', name: '广灵县'}, {
                        id: '140224',
                        name: '灵丘县'
                    }, {id: '140225', name: '浑源县'}, {id: '140226', name: '左云县'}, {id: '140227', name: '大同县'}]
                }, {
                    id: '0353',
                    name: '阳泉市',
                    Area: [{id: '140302', name: '城区'}, {id: '140303', name: '矿区'}, {id: '140311', name: '郊区'}, {
                        id: '140321',
                        name: '平定县'
                    }, {id: '140322', name: '盂县'}]
                }, {
                    id: '0354',
                    name: '晋中市',
                    Area: [{id: '140702', name: '榆次区'}, {id: '140721', name: '榆社县'}, {id: '140722', name: '左权县'}, {
                        id: '140723',
                        name: '和顺县'
                    }, {id: '140724', name: '昔阳县'}, {id: '140725', name: '寿阳县'}, {id: '140726', name: '太谷县'}, {
                        id: '140727',
                        name: '祁县'
                    }, {id: '140728', name: '平遥县'}, {id: '140729', name: '灵石县'}, {id: '140781', name: '介休市'}]
                }, {
                    id: '0355',
                    name: '长治市',
                    Area: [{id: '140402', name: '城区'}, {id: '140411', name: '郊区'}, {id: '140421', name: '长治县'}, {
                        id: '140423',
                        name: '襄垣县'
                    }, {id: '140424', name: '屯留县'}, {id: '140425', name: '平顺县'}, {id: '140426', name: '黎城县'}, {
                        id: '140427',
                        name: '壶关县'
                    }, {id: '140428', name: '长子县'}, {id: '140429', name: '武乡县'}, {id: '140430', name: '沁县'}, {
                        id: '140431',
                        name: '沁源县'
                    }, {id: '140481', name: '潞城市'}]
                }, {
                    id: '0356',
                    name: '晋城市',
                    Area: [{id: '140502', name: '城区'}, {id: '140521', name: '沁水县'}, {id: '140522', name: '阳城县'}, {
                        id: '140524',
                        name: '陵川县'
                    }, {id: '140525', name: '泽州县'}, {id: '140581', name: '高平市'}]
                }, {
                    id: '0357',
                    name: '临汾市',
                    Area: [{id: '141002', name: '尧都区'}, {id: '141021', name: '曲沃县'}, {id: '141022', name: '翼城县'}, {
                        id: '141023',
                        name: '襄汾县'
                    }, {id: '141024', name: '洪洞县'}, {id: '141025', name: '古县'}, {id: '141026', name: '安泽县'}, {
                        id: '141027',
                        name: '浮山县'
                    }, {id: '141028', name: '吉县'}, {id: '141029', name: '乡宁县'}, {id: '141030', name: '大宁县'}, {
                        id: '141031',
                        name: '隰县'
                    }, {id: '141032', name: '永和县'}, {id: '141033', name: '蒲县'}, {id: '141034', name: '汾西县'}, {
                        id: '141081',
                        name: '侯马市'
                    }, {id: '141082', name: '霍州市'}]
                }, {
                    id: '0358',
                    name: '吕梁市',
                    Area: [{id: '141102', name: '离石区'}, {id: '141121', name: '文水县'}, {id: '141122', name: '交城县'}, {
                        id: '141123',
                        name: '兴县'
                    }, {id: '141124', name: '临县'}, {id: '141125', name: '柳林县'}, {id: '141126', name: '石楼县'}, {
                        id: '141127',
                        name: '岚县'
                    }, {id: '141128', name: '方山县'}, {id: '141129', name: '中阳县'}, {id: '141130', name: '交口县'}, {
                        id: '141181',
                        name: '孝义市'
                    }, {id: '141182', name: '汾阳市'}]
                }, {
                    id: '0359',
                    name: '运城市',
                    Area: [{id: '140802', name: '盐湖区'}, {id: '140821', name: '临猗县'}, {id: '140822', name: '万荣县'}, {
                        id: '140823',
                        name: '闻喜县'
                    }, {id: '140824', name: '稷山县'}, {id: '140825', name: '新绛县'}, {id: '140826', name: '绛县'}, {
                        id: '140827',
                        name: '垣曲县'
                    }, {id: '140828', name: '夏县'}, {id: '140829', name: '平陆县'}, {id: '140830', name: '芮城县'}, {
                        id: '140881',
                        name: '永济市'
                    }, {id: '140882', name: '河津市'}]
                }]
            }, {
                id: '150000',
                name: '内蒙古自治区',
                City: [{
                    id: '0470',
                    name: '呼伦贝尔市',
                    Area: [{id: '150702', name: '海拉尔区'}, {id: '150703', name: '扎赉诺尔区'}, {id: '150721', name: '阿荣旗'}, {
                        id: '150722',
                        name: '莫力达瓦达斡尔族自治旗'
                    }, {id: '150723', name: '鄂伦春自治旗'}, {id: '150724', name: '鄂温克族自治旗'}, {
                        id: '150725',
                        name: '陈巴尔虎旗'
                    }, {id: '150726', name: '新巴尔虎左旗'}, {id: '150727', name: '新巴尔虎右旗'}, {id: '150781', name: '满洲里市'}, {
                        id: '150782',
                        name: '牙克石市'
                    }, {id: '150783', name: '扎兰屯市'}, {id: '150784', name: '额尔古纳市'}, {id: '150785', name: '根河市'}]
                }, {
                    id: '0471',
                    name: '呼和浩特市',
                    Area: [{id: '150102', name: '新城区'}, {id: '150103', name: '回民区'}, {id: '150104', name: '玉泉区'}, {
                        id: '150105',
                        name: '赛罕区'
                    }, {id: '150121', name: '土默特左旗'}, {id: '150122', name: '托克托县'}, {id: '150123', name: '和林格尔县'}, {
                        id: '150124',
                        name: '清水河县'
                    }, {id: '150125', name: '武川县'}]
                }, {
                    id: '0472',
                    name: '包头市',
                    Area: [{id: '150202', name: '东河区'}, {id: '150203', name: '昆都仑区'}, {id: '150204', name: '青山区'}, {
                        id: '150205',
                        name: '石拐区'
                    }, {id: '150206', name: '白云鄂博矿区'}, {id: '150207', name: '九原区'}, {id: '150221', name: '土默特右旗'}, {
                        id: '150222',
                        name: '固阳县'
                    }, {id: '150223', name: '达尔罕茂明安联合旗'}]
                }, {
                    id: '0473',
                    name: '乌海市',
                    Area: [{id: '150302', name: '海勃湾区'}, {id: '150303', name: '海南区'}, {id: '150304', name: '乌达区'}]
                }, {
                    id: '0474',
                    name: '乌兰察布市',
                    Area: [{id: '150902', name: '集宁区'}, {id: '150921', name: '卓资县'}, {id: '150922', name: '化德县'}, {
                        id: '150923',
                        name: '商都县'
                    }, {id: '150924', name: '兴和县'}, {id: '150925', name: '凉城县'}, {id: '150926', name: '察哈尔右翼前旗'}, {
                        id: '150927',
                        name: '察哈尔右翼中旗'
                    }, {id: '150928', name: '察哈尔右翼后旗'}, {id: '150929', name: '四子王旗'}, {id: '150981', name: '丰镇市'}]
                }, {
                    id: '0475',
                    name: '通辽市',
                    Area: [{id: '150502', name: '科尔沁区'}, {id: '150521', name: '科尔沁左翼中旗'}, {
                        id: '150522',
                        name: '科尔沁左翼后旗'
                    }, {id: '150523', name: '开鲁县'}, {id: '150524', name: '库伦旗'}, {id: '150525', name: '奈曼旗'}, {
                        id: '150526',
                        name: '扎鲁特旗'
                    }, {id: '150581', name: '霍林郭勒市'}]
                }, {
                    id: '0476',
                    name: '赤峰市',
                    Area: [{id: '150402', name: '红山区'}, {id: '150403', name: '元宝山区'}, {id: '150404', name: '松山区'}, {
                        id: '150421',
                        name: '阿鲁科尔沁旗'
                    }, {id: '150422', name: '巴林左旗'}, {id: '150423', name: '巴林右旗'}, {id: '150424', name: '林西县'}, {
                        id: '150425',
                        name: '克什克腾旗'
                    }, {id: '150426', name: '翁牛特旗'}, {id: '150428', name: '喀喇沁旗'}, {id: '150429', name: '宁城县'}, {
                        id: '150430',
                        name: '敖汉旗'
                    }]
                }, {
                    id: '0477',
                    name: '鄂尔多斯市',
                    Area: [{id: '150602', name: '东胜区'}, {id: '150621', name: '达拉特旗'}, {id: '150622', name: '准格尔旗'}, {
                        id: '150623',
                        name: '鄂托克前旗'
                    }, {id: '150624', name: '鄂托克旗'}, {id: '150625', name: '杭锦旗'}, {id: '150626', name: '乌审旗'}, {
                        id: '150627',
                        name: '伊金霍洛旗'
                    }]
                }, {
                    id: '0478',
                    name: '巴彦淖尔市',
                    Area: [{id: '150802', name: '临河区'}, {id: '150821', name: '五原县'}, {id: '150822', name: '磴口县'}, {
                        id: '150823',
                        name: '乌拉特前旗'
                    }, {id: '150824', name: '乌拉特中旗'}, {id: '150825', name: '乌拉特后旗'}, {id: '150826', name: '杭锦后旗'}]
                }, {
                    id: '0479',
                    name: '锡林郭勒盟',
                    Area: [{id: '152501', name: '二连浩特市'}, {id: '152502', name: '锡林浩特市'}, {
                        id: '152522',
                        name: '阿巴嘎旗'
                    }, {id: '152523', name: '苏尼特左旗'}, {id: '152524', name: '苏尼特右旗'}, {id: '152525', name: '东乌珠穆沁旗'}, {
                        id: '152526',
                        name: '西乌珠穆沁旗'
                    }, {id: '152527', name: '太仆寺旗'}, {id: '152528', name: '镶黄旗'}, {id: '152529', name: '正镶白旗'}, {
                        id: '152530',
                        name: '正蓝旗'
                    }, {id: '152531', name: '多伦县'}]
                }, {
                    id: '0482',
                    name: '兴安盟',
                    Area: [{id: '152201', name: '乌兰浩特市'}, {id: '152202', name: '阿尔山市'}, {
                        id: '152221',
                        name: '科尔沁右翼前旗'
                    }, {id: '152222', name: '科尔沁右翼中旗'}, {id: '152223', name: '扎赉特旗'}, {id: '152224', name: '突泉县'}]
                }, {
                    id: '0483',
                    name: '阿拉善盟',
                    Area: [{id: '152921', name: '阿拉善左旗'}, {id: '152922', name: '阿拉善右旗'}, {id: '152923', name: '额济纳旗'}]
                }]
            }, {
                id: '210000',
                name: '辽宁省',
                City: [{
                    id: '024',
                    name: '沈阳市',
                    Area: [{id: '210102', name: '和平区'}, {id: '210103', name: '沈河区'}, {id: '210104', name: '大东区'}, {
                        id: '210105',
                        name: '皇姑区'
                    }, {id: '210106', name: '铁西区'}, {id: '210111', name: '苏家屯区'}, {id: '210112', name: '浑南区'}, {
                        id: '210113',
                        name: '沈北新区'
                    }, {id: '210114', name: '于洪区'}, {id: '210122', name: '辽中县'}, {id: '210123', name: '康平县'}, {
                        id: '210124',
                        name: '法库县'
                    }, {id: '210181', name: '新民市'}]
                }, {
                    id: '0410',
                    name: '铁岭市',
                    Area: [{id: '211202', name: '银州区'}, {id: '211204', name: '清河区'}, {id: '211221', name: '铁岭县'}, {
                        id: '211223',
                        name: '西丰县'
                    }, {id: '211224', name: '昌图县'}, {id: '211281', name: '调兵山市'}, {id: '211282', name: '开原市'}]
                }, {
                    id: '0411',
                    name: '大连市',
                    Area: [{id: '210202', name: '中山区'}, {id: '210203', name: '西岗区'}, {id: '210204', name: '沙河口区'}, {
                        id: '210211',
                        name: '甘井子区'
                    }, {id: '210212', name: '旅顺口区'}, {id: '210213', name: '金州区'}, {id: '210224', name: '长海县'}, {
                        id: '210281',
                        name: '瓦房店市'
                    }, {id: '210282', name: '普兰店市'}, {id: '210283', name: '庄河市'}]
                }, {
                    id: '0412',
                    name: '鞍山市',
                    Area: [{id: '210302', name: '铁东区'}, {id: '210303', name: '铁西区'}, {id: '210304', name: '立山区'}, {
                        id: '210311',
                        name: '千山区'
                    }, {id: '210321', name: '台安县'}, {id: '210323', name: '岫岩满族自治县'}, {id: '210381', name: '海城市'}]
                }, {
                    id: '0413',
                    name: '抚顺市',
                    Area: [{id: '210402', name: '新抚区'}, {id: '210403', name: '东洲区'}, {id: '210404', name: '望花区'}, {
                        id: '210411',
                        name: '顺城区'
                    }, {id: '210421', name: '抚顺县'}, {id: '210422', name: '新宾满族自治县'}, {id: '210423', name: '清原满族自治县'}]
                }, {
                    id: '0414',
                    name: '本溪市',
                    Area: [{id: '210502', name: '平山区'}, {id: '210503', name: '溪湖区'}, {id: '210504', name: '明山区'}, {
                        id: '210505',
                        name: '南芬区'
                    }, {id: '210521', name: '本溪满族自治县'}, {id: '210522', name: '桓仁满族自治县'}]
                }, {
                    id: '0415',
                    name: '丹东市',
                    Area: [{id: '210602', name: '元宝区'}, {id: '210603', name: '振兴区'}, {id: '210604', name: '振安区'}, {
                        id: '210624',
                        name: '宽甸满族自治县'
                    }, {id: '210681', name: '东港市'}, {id: '210682', name: '凤城市'}]
                }, {
                    id: '0416',
                    name: '锦州市',
                    Area: [{id: '210702', name: '古塔区'}, {id: '210703', name: '凌河区'}, {id: '210711', name: '太和区'}, {
                        id: '210726',
                        name: '黑山县'
                    }, {id: '210727', name: '义县'}, {id: '210781', name: '凌海市'}, {id: '210782', name: '北镇市'}]
                }, {
                    id: '0417',
                    name: '营口市',
                    Area: [{id: '210802', name: '站前区'}, {id: '210803', name: '西市区'}, {id: '210804', name: '鲅鱼圈区'}, {
                        id: '210811',
                        name: '老边区'
                    }, {id: '210881', name: '盖州市'}, {id: '210882', name: '大石桥市'}]
                }, {
                    id: '0418',
                    name: '阜新市',
                    Area: [{id: '210902', name: '海州区'}, {id: '210903', name: '新邱区'}, {id: '210904', name: '太平区'}, {
                        id: '210905',
                        name: '清河门区'
                    }, {id: '210911', name: '细河区'}, {id: '210921', name: '阜新蒙古族自治县'}, {id: '210922', name: '彰武县'}]
                }, {
                    id: '0419',
                    name: '辽阳市',
                    Area: [{id: '211002', name: '白塔区'}, {id: '211003', name: '文圣区'}, {id: '211004', name: '宏伟区'}, {
                        id: '211005',
                        name: '弓长岭区'
                    }, {id: '211011', name: '太子河区'}, {id: '211021', name: '辽阳县'}, {id: '211081', name: '灯塔市'}]
                }, {
                    id: '0421',
                    name: '朝阳市',
                    Area: [{id: '211302', name: '双塔区'}, {id: '211303', name: '龙城区'}, {id: '211321', name: '朝阳县'}, {
                        id: '211322',
                        name: '建平县'
                    }, {id: '211324', name: '喀喇沁左翼蒙古族自治县'}, {id: '211381', name: '北票市'}, {id: '211382', name: '凌源市'}]
                }, {
                    id: '0427',
                    name: '盘锦市',
                    Area: [{id: '211102', name: '双台子区'}, {id: '211103', name: '兴隆台区'}, {id: '211121', name: '大洼县'}, {
                        id: '211122',
                        name: '盘山县'
                    }]
                }, {
                    id: '0429',
                    name: '葫芦岛市',
                    Area: [{id: '211402', name: '连山区'}, {id: '211403', name: '龙港区'}, {id: '211404', name: '南票区'}, {
                        id: '211421',
                        name: '绥中县'
                    }, {id: '211422', name: '建昌县'}, {id: '211481', name: '兴城市'}]
                }]
            }]
        }
    };
    
    static cityId2index(provinceId, cityId, areaId) {
        let provinceIndex = 0;
        let cityIndex = 0;
        let areaIndex = 0;
        if (provinceId) {
            for (let i = 0; i < this.CityZoneCode.China.Province.length; i++) {
                if (this.CityZoneCode.China.Province[i].id == provinceId) {
                    provinceIndex = i;
                    if (cityId) {
                        for (let j = 0; j < this.CityZoneCode.China.Province[i].City.length; j++) {
                            if (this.CityZoneCode.China.Province[i].City[j].id == cityId) {
                                cityIndex = j;
                                if (areaId) {
                                    for (let k = 0; k < this.CityZoneCode.China.Province[i].City[j].Area.length; k++) {
                                        if (this.CityZoneCode.China.Province[i].City[j].Area[k].id == areaId) {
                                            areaIndex = k;
                                        }
                                    }
                                }
                            }
                        }
                    }
                }
            }
        }
        let index = {
            provinceIndex: provinceIndex,
            cityIndex: cityIndex,
            areaIndex: areaIndex
        };
        return index;
    }
    
    static cityId2name(provinceId, cityId, areaId) {
        let addressIndex = this.cityId2index(provinceId, cityId, areaId);
        let province = cityCode.CityZoneCode.China.Province[addressIndex.provinceIndex].name;
        let city = cityCode.CityZoneCode.China.Province[addressIndex.provinceIndex].City[addressIndex.cityIndex].name;
        let area = '';
        if(cityCode.CityZoneCode.China.Province[addressIndex.provinceIndex].City[addressIndex.cityIndex].Area[addressIndex.areaIndex]) {
            area = cityCode.CityZoneCode.China.Province[addressIndex.provinceIndex].City[addressIndex.cityIndex].Area[addressIndex.areaIndex].name;
        }
        return address = { province, city, area };
    }
}
